In [3]:
import numpy as np
import pandas as pd
frame3 = np.arange(5)

In [4]:
frame3

array([0, 1, 2, 3, 4])

In [9]:
ser = pd.Series([1,2,3,4], index= ['d', 'b', 'c', 'a'])

In [10]:
ser1 = ser.reindex(['a','b','c','d'])

In [14]:

ser2 = np.arange(9).reshape(3,3)

Exception: Data must be 1-dimensional

In [15]:
ser = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','b','c'],
                  columns=['ger', 'ays', 'den']);

In [16]:
ser

   ger  ays  den
a    0    1    2
b    3    4    5
c    6    7    8

In [17]:
ser.drop('b', axis=0)

   ger  ays  den
a    0    1    2
c    6    7    8

In [19]:
ser.drop('ays', axis=1)

   ger  den
a    0    2
b    3    5
c    6    8

In [20]:
ser.T

     a  b  c
ger  0  3  6
ays  1  4  7
den  2  5  8

In [21]:
ser

   ger  ays  den
a    0    1    2
b    3    4    5
c    6    7    8

In [22]:
a = list('bcd')

In [23]:
a

['b', 'c', 'd']

In [24]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
print(s1)
print(s2)
print(s1+s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64
a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [27]:
#Arithmetic methods with fill values
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

#using add method
print(df1.add(df2, fill_value=0))

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [1]:
np.random.randn(4, 3)

NameError: name 'np' is not defined

In [5]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [6]:
df.sum(axis=1)

a    3.947907
a   -1.050858
b   -2.550869
b   -0.747047
dtype: float64

In [12]:
df

          0         1         2
a  2.408601  0.604231  0.935074
a -0.539382  0.124233 -0.635709
b -0.894976 -0.515448 -1.140445
b -0.313900  0.298486 -0.731633

In [15]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
data.dropna(axis=0, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [43]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.616165  0.486865 -1.476248
1 -0.101227 -0.549162 -0.574471
2 -0.663561  0.041568  0.810162
3 -1.635411  0.580868 -1.167063
4 -2.145092  0.901062 -1.378115
5 -0.773141 -1.213968 -1.802566
6  0.520975  1.096783 -1.727257

In [44]:
df[:4][1] = NA

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [42]:
df

          0         1         2
0       NaN       NaN       NaN
1       NaN       NaN       NaN
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4  0.368711  1.430741  2.774979
5  0.329086 -0.625693  0.485935
6  1.149316 -0.143922  0.739441

In [48]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [50]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [51]:
data = pd.Series(np.random.randn(10),
index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.491364
   2    0.083098
   3    0.273425
b  1    0.664531
   2    0.827099
   3   -0.866893
c  1   -0.772214
   2   -0.158931
d  2   -1.210615
   3   -0.436085
dtype: float64